BtmsGateway.Test/Services/Converter/Fixtures/DecisionNotificationWithHtmlEncoding.xml

<?xml version="1.0" encoding="UTF-8"?>
<NS1:Envelope xmlns:NS1="http://www.w3.org/2003/05/soap-envelope">
  <NS1:Header>
    <NS2:Security xmlns:NS2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" NS1:role="system">
      <NS2:UsernameToken>
        <NS2:Username>ibmtest</NS2:Username>
      </NS2:UsernameToken>
    </NS2:Security>
  </NS1:Header>
  <NS1:Body>
    <NS3:DecisionNotification xmlns:NS3="http://uk.gov.hmrc.ITSW2.ws">&lt;DecisionNotification xmlns="http://www.hmrc.gov.uk/webservices/itsw/ws/decisionnotification"&gt;&lt;ServiceHeader&gt;&lt;SourceSystem&gt;ALVS&lt;/SourceSystem&gt;&lt;DestinationSystem&gt;CDS&lt;/DestinationSystem&gt;&lt;CorrelationId&gt;000&lt;/CorrelationId&gt;&lt;ServiceCallTimestamp&gt;2023-06-30T07:34:14.405827&lt;/ServiceCallTimestamp&gt;&lt;/ServiceHeader&gt;&lt;Header&gt;&lt;EntryReference&gt;23GB1234567890ABC8&lt;/EntryReference&gt;&lt;EntryVersionNumber&gt;1&lt;/EntryVersionNumber&gt;&lt;DecisionNumber&gt;1&lt;/DecisionNumber&gt;&lt;/Header&gt;&lt;Item&gt;&lt;ItemNumber&gt;1&lt;/ItemNumber&gt;&lt;Check&gt;&lt;CheckCode&gt;H218&lt;/CheckCode&gt;&lt;DecisionCode&gt;C02&lt;/DecisionCode&gt;&lt;DecisionValidUntil&gt;202307042359&lt;/DecisionValidUntil&gt;&lt;/Check&gt;&lt;Check&gt;&lt;CheckCode&gt;H219&lt;/CheckCode&gt;&lt;DecisionCode&gt;C03&lt;/DecisionCode&gt;&lt;/Check&gt;&lt;Check&gt;&lt;CheckCode&gt;H223&lt;/CheckCode&gt;&lt;DecisionCode&gt;C03&lt;/DecisionCode&gt;&lt;/Check&gt;&lt;/Item&gt;&lt;Item&gt;&lt;ItemNumber&gt;2&lt;/ItemNumber&gt;&lt;Check&gt;&lt;CheckCode&gt;H219&lt;/CheckCode&gt;&lt;DecisionCode&gt;C03&lt;/DecisionCode&gt;&lt;/Check&gt;&lt;Check&gt;&lt;CheckCode&gt;H223&lt;/CheckCode&gt;&lt;DecisionCode&gt;C03&lt;/DecisionCode&gt;&lt;/Check&gt;&lt;/Item&gt;&lt;/DecisionNotification&gt;</NS3:DecisionNotification>
  </NS1:Body>
</NS1:Envelope>